results/scenario1_baseline/s1_run3_k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m0s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 005/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 005/100 VUs  0m01.0s/1m30.0s

running (0m02.0s), 010/100 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  0m02.0s/1m30.0s

running (0m03.0s), 015/100 VUs, 15 complete and 0 interrupted iterations
default   [   3% ] 015/100 VUs  0m03.0s/1m30.0s

running (0m04.0s), 020/100 VUs, 30 complete and 0 interrupted iterations
default   [   4% ] 020/100 VUs  0m04.0s/1m30.0s

running (0m05.0s), 025/100 VUs, 50 complete and 0 interrupted iterations
default   [   6% ] 025/100 VUs  0m05.0s/1m30.0s

running (0m06.0s), 030/100 VUs, 75 complete and 0 interrupted iterations
default   [   7% ] 030/100 VUs  0m06.0s/1m30.0s

running (0m07.0s), 035/100 VUs, 105 complete and 0 interrupted iterations
default   [   8% ] 035/100 VUs  0m07.0s/1m30.0s

running (0m08.0s), 040/100 VUs, 140 complete and 0 interrupted iterations
default   [   9% ] 040/100 VUs  0m08.0s/1m30.0s

running (0m09.0s), 045/100 VUs, 180 complete and 0 interrupted iterations
default   [  10% ] 045/100 VUs  0m09.0s/1m30.0s

running (0m10.0s), 050/100 VUs, 225 complete and 0 interrupted iterations
default   [  11% ] 050/100 VUs  0m10.0s/1m30.0s

running (0m11.0s), 055/100 VUs, 275 complete and 0 interrupted iterations
default   [  12% ] 055/100 VUs  0m11.0s/1m30.0s

running (0m12.0s), 060/100 VUs, 330 complete and 0 interrupted iterations
default   [  13% ] 060/100 VUs  0m12.0s/1m30.0s

running (0m13.0s), 065/100 VUs, 390 complete and 0 interrupted iterations
default   [  14% ] 065/100 VUs  0m13.0s/1m30.0s

running (0m14.0s), 070/100 VUs, 455 complete and 0 interrupted iterations
default   [  16% ] 070/100 VUs  0m14.0s/1m30.0s

running (0m15.0s), 075/100 VUs, 525 complete and 0 interrupted iterations
default   [  17% ] 075/100 VUs  0m15.0s/1m30.0s

running (0m16.0s), 080/100 VUs, 600 complete and 0 interrupted iterations
default   [  18% ] 080/100 VUs  0m16.0s/1m30.0s

running (0m17.0s), 085/100 VUs, 680 complete and 0 interrupted iterations
default   [  19% ] 085/100 VUs  0m17.0s/1m30.0s

running (0m18.0s), 090/100 VUs, 765 complete and 0 interrupted iterations
default   [  20% ] 090/100 VUs  0m18.0s/1m30.0s

running (0m19.0s), 095/100 VUs, 855 complete and 0 interrupted iterations
default   [  21% ] 095/100 VUs  0m19.0s/1m30.0s

running (0m20.0s), 099/100 VUs, 949 complete and 0 interrupted iterations
default   [  22% ] 099/100 VUs  0m20.0s/1m30.0s

running (0m21.0s), 100/100 VUs, 1048 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m21.0s/1m30.0s

running (0m22.0s), 100/100 VUs, 1148 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m22.0s/1m30.0s

running (0m23.0s), 100/100 VUs, 1247 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m23.0s/1m30.0s

running (0m24.0s), 100/100 VUs, 1347 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m24.0s/1m30.0s

running (0m25.0s), 100/100 VUs, 1447 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  0m25.0s/1m30.0s

running (0m26.0s), 100/100 VUs, 1546 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m26.0s/1m30.0s

running (0m27.0s), 100/100 VUs, 1646 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  0m27.0s/1m30.0s

running (0m28.0s), 100/100 VUs, 1745 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m28.0s/1m30.0s

running (0m29.0s), 100/100 VUs, 1845 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m29.0s/1m30.0s

running (0m30.0s), 100/100 VUs, 1943 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  0m30.0s/1m30.0s

running (0m31.0s), 100/100 VUs, 2043 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m31.0s/1m30.0s

running (0m32.0s), 100/100 VUs, 2143 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m32.0s/1m30.0s

running (0m33.0s), 100/100 VUs, 2243 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  0m33.0s/1m30.0s

running (0m34.0s), 100/100 VUs, 2343 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  0m34.0s/1m30.0s

running (0m35.0s), 100/100 VUs, 2443 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m35.0s/1m30.0s

running (0m36.0s), 100/100 VUs, 2543 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  0m36.0s/1m30.0s

running (0m37.0s), 100/100 VUs, 2643 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m37.0s/1m30.0s

running (0m38.0s), 100/100 VUs, 2740 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  0m38.0s/1m30.0s

running (0m39.0s), 100/100 VUs, 2840 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  0m39.0s/1m30.0s

running (0m40.0s), 100/100 VUs, 2940 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  0m40.0s/1m30.0s

running (0m41.0s), 100/100 VUs, 3040 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  0m41.0s/1m30.0s

running (0m42.0s), 100/100 VUs, 3140 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  0m42.0s/1m30.0s

running (0m43.0s), 100/100 VUs, 3237 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  0m43.0s/1m30.0s

running (0m44.0s), 100/100 VUs, 3337 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  0m44.0s/1m30.0s

running (0m45.0s), 100/100 VUs, 3437 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  0m45.0s/1m30.0s

running (0m46.0s), 100/100 VUs, 3537 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  0m46.0s/1m30.0s

running (0m47.0s), 100/100 VUs, 3637 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  0m47.0s/1m30.0s

running (0m48.0s), 100/100 VUs, 3737 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  0m48.0s/1m30.0s

running (0m49.0s), 100/100 VUs, 3837 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  0m49.0s/1m30.0s

running (0m50.0s), 100/100 VUs, 3937 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  0m50.0s/1m30.0s

running (0m51.0s), 100/100 VUs, 4030 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  0m51.0s/1m30.0s

running (0m52.0s), 100/100 VUs, 4130 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  0m52.0s/1m30.0s

running (0m53.0s), 100/100 VUs, 4230 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  0m53.0s/1m30.0s

running (0m54.0s), 100/100 VUs, 4330 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  0m54.0s/1m30.0s

running (0m55.0s), 100/100 VUs, 4430 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  0m55.0s/1m30.0s

running (0m56.0s), 100/100 VUs, 4530 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  0m56.0s/1m30.0s

running (0m57.0s), 100/100 VUs, 4630 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  0m57.0s/1m30.0s

running (0m58.0s), 100/100 VUs, 4730 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  0m58.0s/1m30.0s

running (0m59.0s), 100/100 VUs, 4830 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  0m59.0s/1m30.0s

running (1m00.0s), 100/100 VUs, 4930 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m00.0s/1m30.0s

running (1m01.0s), 100/100 VUs, 5030 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m01.0s/1m30.0s

running (1m02.0s), 100/100 VUs, 5130 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m02.0s/1m30.0s

running (1m03.0s), 100/100 VUs, 5230 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m03.0s/1m30.0s

running (1m04.0s), 100/100 VUs, 5330 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m04.0s/1m30.0s

running (1m05.0s), 100/100 VUs, 5430 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m05.0s/1m30.0s

running (1m06.0s), 100/100 VUs, 5530 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m06.0s/1m30.0s

running (1m07.0s), 100/100 VUs, 5630 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m07.0s/1m30.0s

running (1m08.0s), 100/100 VUs, 5730 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m08.0s/1m30.0s

running (1m09.0s), 100/100 VUs, 5830 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m09.0s/1m30.0s

running (1m10.0s), 100/100 VUs, 5930 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m10.0s/1m30.0s

running (1m11.0s), 100/100 VUs, 6030 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m11.0s/1m30.0s

running (1m12.0s), 100/100 VUs, 6130 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m12.0s/1m30.0s

running (1m13.0s), 100/100 VUs, 6230 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m13.0s/1m30.0s

running (1m14.0s), 100/100 VUs, 6330 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m14.0s/1m30.0s

running (1m15.0s), 100/100 VUs, 6430 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m15.0s/1m30.0s

running (1m16.0s), 100/100 VUs, 6530 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m16.0s/1m30.0s

running (1m17.0s), 100/100 VUs, 6630 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  1m17.0s/1m30.0s

running (1m18.0s), 100/100 VUs, 6730 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  1m18.0s/1m30.0s

running (1m19.0s), 100/100 VUs, 6830 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  1m19.0s/1m30.0s

running (1m20.0s), 100/100 VUs, 6930 complete and 0 interrupted iterations
default   [  89% ] 100/100 VUs  1m20.0s/1m30.0s

running (1m21.0s), 095/100 VUs, 7030 complete and 0 interrupted iterations
default   [  90% ] 095/100 VUs  1m21.0s/1m30.0s

running (1m22.0s), 085/100 VUs, 7125 complete and 0 interrupted iterations
default   [  91% ] 085/100 VUs  1m22.0s/1m30.0s

running (1m23.0s), 075/100 VUs, 7210 complete and 0 interrupted iterations
default   [  92% ] 075/100 VUs  1m23.0s/1m30.0s

running (1m24.0s), 065/100 VUs, 7285 complete and 0 interrupted iterations
default   [  93% ] 065/100 VUs  1m24.0s/1m30.0s

running (1m25.0s), 055/100 VUs, 7350 complete and 0 interrupted iterations
default   [  94% ] 055/100 VUs  1m25.0s/1m30.0s

running (1m26.0s), 045/100 VUs, 7405 complete and 0 interrupted iterations
default   [  96% ] 045/100 VUs  1m26.0s/1m30.0s

running (1m27.0s), 035/100 VUs, 7450 complete and 0 interrupted iterations
default   [  97% ] 035/100 VUs  1m27.0s/1m30.0s

running (1m28.0s), 025/100 VUs, 7485 complete and 0 interrupted iterations
default   [  98% ] 025/100 VUs  1m28.0s/1m30.0s

running (1m29.0s), 015/100 VUs, 7510 complete and 0 interrupted iterations
default   [  99% ] 015/100 VUs  1m29.0s/1m30.0s

running (1m30.0s), 005/100 VUs, 7525 complete and 0 interrupted iterations
default   [ 100% ] 005/100 VUs  1m30.0s/1m30.0s


  █ TOTAL RESULTS 

    checks_total.......: 7530    82.952578/s
    checks_succeeded...: 100.00% 7530 out of 7530
    checks_failed......: 0.00%   0 out of 7530

    ✓ status was 200

    HTTP
    http_req_duration..............: avg=2.99ms min=338µs med=2.89ms max=11.86ms p(90)=5.04ms p(95)=5.59ms
      { expected_response:true }...: avg=2.99ms min=338µs med=2.89ms max=11.86ms p(90)=5.04ms p(95)=5.59ms
    http_req_failed................: 0.00%  0 out of 7530
    http_reqs......................: 7530   82.952578/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s    med=1s     max=1.01s   p(90)=1s     p(95)=1s    
    iterations.....................: 7530   82.952578/s
    vus............................: 5      min=5         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 2.2 MB 24 kB/s
    data_sent......................: 550 kB 6.1 kB/s



running (1m30.8s), 000/100 VUs, 7530 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m30s